Autodesk.Revit.DB.Analysis.HVACLoadType.PowerYearScheduleId
The schedule for the power usage over the year.
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadType.LightingYearScheduleId
The schedule for the use of lighting over the year.
Since:
2018

Autodesk.Revit.DB.Analysis.HVACLoadType.OccupancyYearScheduleId
The schedule for the amount of people over the year.
Since:
2018